In [2]:
student={
    'name':'ram',
    'age':22,
    'address':['ktm','brt','dharan'],
    'age':25
}
print(student)

{'name': 'ram', 'age': 25, 'address': ['ktm', 'brt', 'dharan']}

In [4]:
student={
    'name':'ram',
    'age':22,
    'address':['ktm','brt','dharan']
}
print(student['name'])
print(student['address'])

ram
['ktm', 'brt', 'dharan']

In [5]:
student['stream']='science'
print(student)

{'name': 'ram', 'age': 22, 'address': ['ktm', 'brt', 'dharan'], 'stream': 'science'}

In [6]:
student.keys()

dict_keys(['name', 'age', 'address', 'stream'])

In [7]:
student.values()

dict_values(['ram', 22, ['ktm', 'brt', 'dharan'], 'science'])

In [8]:
student.items()

dict_items([('name', 'ram'), ('age', 22), ('address', ['ktm', 'brt', 'dharan']), ('stream', 'science')])

In [10]:
import pandas as pd
user_series = pd.Series([1, 5, 9 ,8, 10])
user_series

0     1
1     5
2     9
3     8
4    10
dtype: int64

In [12]:
student_name = pd.Series(['Ram','Shyam',"Hari"])
student_address = pd.Series(['ktm','Brt','Dharan'])

In [13]:
student_name

0      Ram
1    Shyam
2     Hari
dtype: object

In [15]:
student_address

0       ktm
1       Brt
2    Dharan
dtype: object

In [22]:
##dataframe

In [25]:
df = pd.DataFrame({'name ':student_name,'address':student_address})

In [26]:
df

   name  address
0    Ram     ktm
1  Shyam     Brt
2   Hari  Dharan

In [36]:
df = pd.read_csv('info.csv')
df

      name  age address  mark
0      ram   21     ktm  77.5
1    shyam   20     brt  87.5
2     hari   19     bkt  97.5
3     sita   18  dharan  67.5
4     nita   17     aus  79.0
5    nisha   13     USA  51.0
6   anisha   19     ktm  61.0
7    tracy   31     pkr  51.0
8    nancy   41     ktm  78.0
9   amisha   31  dharan  76.0
10    rina   35     brt  97.0

In [37]:
df['name']

0        ram
1      shyam
2       hari
3       sita
4       nita
5      nisha
6     anisha
7      tracy
8      nancy
9     amisha
10      rina
Name: name, dtype: object

In [38]:
df['age']

0     21
1     20
2     19
3     18
4     17
5     13
6     19
7     31
8     41
9     31
10    35
Name: age, dtype: int64

In [39]:
df['mark']

0     77.5
1     87.5
2     97.5
3     67.5
4     79.0
5     51.0
6     61.0
7     51.0
8     78.0
9     76.0
10    97.0
Name: mark, dtype: float64

In [40]:
df.head()

    name  age address  mark
0    ram   21     ktm  77.5
1  shyam   20     brt  87.5
2   hari   19     bkt  97.5
3   sita   18  dharan  67.5
4   nita   17     aus  79.0

In [41]:
df.head(6)

    name  age address  mark
0    ram   21     ktm  77.5
1  shyam   20     brt  87.5
2   hari   19     bkt  97.5
3   sita   18  dharan  67.5
4   nita   17     aus  79.0
5  nisha   13     USA  51.0

In [42]:
df.tail()

      name  age address  mark
6   anisha   19     ktm  61.0
7    tracy   31     pkr  51.0
8    nancy   41     ktm  78.0
9   amisha   31  dharan  76.0
10    rina   35     brt  97.0

In [43]:
df[2:5]

   name  age address  mark
2  hari   19     bkt  97.5
3  sita   18  dharan  67.5
4  nita   17     aus  79.0

In [44]:
pwd

'C:\\Users\\Admin\\Test_t'

In [45]:
df['name']

0        ram
1      shyam
2       hari
3       sita
4       nita
5      nisha
6     anisha
7      tracy
8      nancy
9     amisha
10      rina
Name: name, dtype: object

In [46]:
df

      name  age address  mark
0      ram   21     ktm  77.5
1    shyam   20     brt  87.5
2     hari   19     bkt  97.5
3     sita   18  dharan  67.5
4     nita   17     aus  79.0
5    nisha   13     USA  51.0
6   anisha   19     ktm  61.0
7    tracy   31     pkr  51.0
8    nancy   41     ktm  78.0
9   amisha   31  dharan  76.0
10    rina   35     brt  97.0

In [47]:
df=pd.read_csv('info.csv')

In [48]:
df

    sn    name  age address  mark
0    1     ram   21     ktm  77.5
1    2   shyam   20     brt  87.5
2    3    hari   19     bkt  97.5
3    4    sita   18  dharan  67.5
4    5    nita   17     aus  79.0
5    6   nisha   13     USA  51.0
6    7  anisha   19     ktm  61.0
7    8   tracy   31     pkr  51.0
8    9   nancy   41     ktm  78.0
9   10  amisha   31  dharan  76.0
10  11    rina   35     brt  97.0

In [49]:
df=pd.read_csv('info.csv',index_col='sn')
df

      name  age address  mark
sn
1      ram   21     ktm  77.5
2    shyam   20     brt  87.5
3     hari   19     bkt  97.5
4     sita   18  dharan  67.5
5     nita   17     aus  79.0
6    nisha   13     USA  51.0
7   anisha   19     ktm  61.0
8    tracy   31     pkr  51.0
9    nancy   41     ktm  78.0
10  amisha   31  dharan  76.0
11    rina   35     brt  97.0

In [50]:
df=pd.read_csv('info.csv',index_col='name')
df

        sn  age address  mark
name
ram      1   21     ktm  77.5
shyam    2   20     brt  87.5
hari     3   19     bkt  97.5
sita     4   18  dharan  67.5
nita     5   17     aus  79.0
nisha    6   13     USA  51.0
anisha   7   19     ktm  61.0
tracy    8   31     pkr  51.0
nancy    9   41     ktm  78.0
amisha  10   31  dharan  76.0
rina    11   35     brt  97.0